# sua.yaml - YOLOv8n with P2 Head
# Parameters
nc: 1  # số lượng lớp (ở đây là 1: person)
scales: # YOLOv8n (Bản Nano để chạy mượt trên RTX 3050)
  n: [0.33, 0.25, 1024] 

# 1. Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]   # 9

# 2. Head (với nhánh P2 bổ sung)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]        # 12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]        # 15 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 2], 1, Concat, [1]]  # cat backbone P2 (Nhánh nhìn gần)(công dụng làm tăng độ chính xác cho các đối tượng nhỏ)
  - [-1, 3, C2f, [128]]        # 18 (P2/4-tiny)

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 15], 1, Concat, [1]] # cat head P3 (nhánh nhìn gần  với nhánh nhìn xa)(cộng nhánh P3/8 với nhánh P2/4)
  - [-1, 3, C2f, [256]]        # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]]        # 24 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]       # 27 (P5/32-large)

  - [[18, 21, 24, 27], 1, Detect, [nc]] # Detect trên 4 quy mô (P2, P3, P4, P5)


  